{
  "backend/main.mo": "Motoko actor exposing a query method that returns static site info including name, tagline, and hero CTA.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all major frontend components and pages.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining how to build and deploy the project to the Internet Computer mainnet.",
  "frontend/index.css": "Global Tailwind CSS file defining OKLCH-based theme variables and light/dark mode styles.",
  "frontend/index.html": "Base HTML entry file setting metadata and loading the React app via main.jsx.",
  "frontend/README.md": "Frontend quick-start guide covering setup, scripts, and development workflow using React, Vite, and Tailwind.",
  "frontend/src/App.jsx": "React router configuration using hash history and wrapping routes with a theme provider.",
  "frontend/src/App.tsx": "TypeScript version of the router setup with typings registered for TanStack Router.",
  "frontend/src/components/SiteFooter.tsx": "Footer component showing branding, navigation links, social icons, and smooth-scroll contact behavior.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper combining navbar, routed content outlet, footer, and theme color provider.",
  "frontend/src/components/SiteNavbar.tsx": "Responsive navbar component with navigation links and theme/preset controls for desktop and mobile layouts.",
  "frontend/src/components/TestimonialsSlider.tsx": "Interactive testimonial slider showing user reviews with navigation arrows and indicator dots.",
  "frontend/src/components/ThemeColorProvider.tsx": "Provides theme color context using useThemeColor and exposes preset management to children.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth flow, storing identity, exposing login/logout, and handling initialization state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future backend-related React Query hooks.",
  "frontend/src/hooks/useSiteInfo.ts": "Fetches site info from the backend actor with fallback values and loading state handling.",
  "frontend/src/hooks/useThemeColor.ts": "Manages theme color presets, loading from storage, validating values, and applying CSS variables based on mode.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light/dark theme variables, responsive utilities, and base styling rules.",
  "frontend/src/main.jsx": "Bootstraps the React app with React Query and InternetIdentityProvider and renders App.jsx.",
  "frontend/src/main.tsx": "TypeScript entry point that initializes React app with React Query and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "Displays an About page with hero section, agency story, and values using styled components.",
  "frontend/src/pages/Booking.tsx": "Implements a booking form with prefilled package data, submission handling, and a WhatsApp contact link.",
  "frontend/src/pages/Home.tsx": "Renders the homepage with hero banner, featured destinations, contact form, and site info integration.",
  "frontend/src/pages/HoneymoonOffers.tsx": "Shows a list of honeymoon travel packages with details, imagery, and navigation to booking.",
  "frontend/src/pages/Privacy.tsx": "Provides the site’s privacy policy with sections on data collection, usage, security, cookies, and external links.",
  "frontend/src/pages/Services.tsx": "Renders the Services page with hero sections and a grid of cards describing travel-related services like flights, hotels, and transportation.",
  "frontend/src/pages/TourGuide.tsx": "Displays the Tour Guide page featuring hero content, guide descriptions, images, and feature cards highlighting guide capabilities.",
  "frontend/src/pages/TourPackages.tsx": "Implements the Tour Packages page, defining a list of travel packages and rendering them as cards with details and images.",
  "frontend/src/pages/Vehicles.tsx": "Shows the Vehicles page with a hero section and a grid of vehicle cards populated from a static list.",
  "frontend/src/utils/slug.ts": "Provides functions to normalize, validate, and generate deterministic slugs, including handling hostname-based deployment IDs.",
  "frontend/src/vite-env.d.ts": "Type declaration file enabling Vite-specific TypeScript types.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, animations, and plugin settings for the project.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-oriented builds, specifying module resolution and included files.",
  "frontend/vite.config.ts": "Vite configuration enabling React, path aliases, environment definitions, dev server settings, and build output options.",
  "project_state.json": "Defines the project’s deployment-only requirements and lists four pending feature requests focused on deploying and verifying the site without modifying any files."
}