{
  "backend/main.mo": "Motoko actor exposing a query function returning static site info including name, tagline, and hero CTA.",
  "feature_evidence.json": "Feature evidence report mapping requirements to affected frontend files and components with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend source files for quick reference.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions providing light/dark theme tokens and base styling.",
  "frontend/index.html": "Base HTML entry file setting metadata, root mount point, and loading the main React script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with ThemeProvider for theme support.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with branding, navigation links, social icons, and contact scroll handling.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper composing navbar, routed content outlet, footer, and theme color provider.",
  "frontend/src/components/SiteNavbar.tsx": "Responsive navbar defining required navigation links with theme switching and color presets.",
  "frontend/src/components/TestimonialsSlider.tsx": "React slider component showing rotating travel testimonials with navigation controls.",
  "frontend/src/components/ThemeColorProvider.tsx": "Provides theme color context using useThemeColor and exposes presets and updater.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query backend hooks.",
  "frontend/src/hooks/useSiteInfo.ts": "Fetches site info from the backend actor with fallback values when unavailable.",
  "frontend/src/hooks/useThemeColor.ts": "Manages theme color presets, storing selection and applying CSS variables dynamically.",
  "frontend/src/index.css": "Tailwind base config defining CSS variables and themes for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/About.tsx": "About page with hero, story section, and values grid describing the travel agency.",
  "frontend/src/pages/Booking.tsx": "A booking form page that handles user input, auto-fills package names from URL params, and shows a confirmation message after submission.",
  "frontend/src/pages/Home.tsx": "Homepage with a hero section, featured destinations, and a contact form with basic submission handling.",
  "frontend/src/pages/HoneymoonOffers.tsx": "Displays a list of honeymoon travel packages with details, images, and pricing.",
  "frontend/src/pages/Privacy.tsx": "Static privacy policy page outlining data collection, usage, security, and cookies.",
  "frontend/src/pages/Services.tsx": "Services overview page presenting various travel-related offerings with icons and descriptions.",
  "frontend/src/pages/TourGuide.tsx": "Page presenting tour guide highlights with hero, descriptive sections, features, and an image showcasing guide qualities.",
  "frontend/src/pages/TourPackages.tsx": "Displays a list of tour packages with details, images, and navigation, structured with a hero section and package grid.",
  "frontend/src/pages/Vehicles.tsx": "Shows a fleet of vehicles with specs, pricing, features, and images, including a hero and grid layout.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, fonts, animations, and container settings.",
  "project_state.json": "Project metadata describing requirements, features, architecture notes, and overall build state for the travel agency site."
}