{
  "backend/main.mo": "Returns static site info including name and tagline.",
  "feature_evidence.json": "Lists feature evidence entries with associated pages, components, and requirements.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of major frontend files and pages for reference.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH-based theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Configures routes with TanStack Router and wraps the app in ThemeProvider.",
  "frontend/src/components/SiteFooter.tsx": "Footer component showing branding, links, and attribution using site info.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper combining navbar, routed content, and footer within a theme provider.",
  "frontend/src/components/SiteNavbar.tsx": "Responsive navbar with navigation links, theme toggle, and theme-color selector.",
  "frontend/src/components/ThemeColorProvider.tsx": "Context provider exposing theme color presets and change handler.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the authenticated or anonymous backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks; currently empty.",
  "frontend/src/hooks/useSiteInfo.ts": "Fetches site info via React Query with a fallback when the backend actor is unavailable.",
  "frontend/src/hooks/useThemeColor.ts": "Manages theme color presets, syncing selection with localStorage and applying CSS variables based on light/dark mode.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes, including color tokens and layout styles.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "Renders the About page with a hero section, story content, and values displayed in cards.",
  "frontend/src/pages/Booking.tsx": "Implements a booking form page with prefilled query params, form state handling, and a confirmation message after submission.",
  "frontend/src/pages/Home.tsx": "Renders the homepage with a hero section, about section, and a contact form with state handling for submissions.",
  "frontend/src/pages/HoneymoonOffers.tsx": "Displays a list of predefined honeymoon travel packages with images, details, and a hero section.",
  "frontend/src/pages/Privacy.tsx": "Shows the site's privacy policy broken into sections using card components.",
  "frontend/src/pages/Services.tsx": "Provides a hero section and grid of service cards describing various travel-related offerings.",
  "frontend/src/pages/TourGuide.tsx": "Presents information about the company’s tour guides, including benefits and feature highlights with supporting images.",
  "frontend/src/pages/TourPackages.tsx": "Renders a tour packages page showing multiple travel packages with details, images, and a hero section.",
  "frontend/src/pages/Vehicles.tsx": "Displays a fleet of vehicles with capacities, features, pricing, and supporting hero/section layouts.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, and content paths.",
  "project_state.json": "Stores project metadata, feature requirements, image specifications, and architectural notes."
}