{
  "backend/main.mo": "Motoko actor exposing a query that returns static site info including name, tagline, and hero CTA.",
  "feature_evidence.json": "Feature evidence report listing required IC configuration, deployment needs, and related files/components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend components, pages, hooks, and config files.",
  "frontend/DEPLOYMENT.md": "Full deployment guide explaining prerequisites, local testing, and IC mainnet deployment steps for backend and frontend canisters.",
  "frontend/index.css": "Tailwind base variables and dark mode tokens defining the site's color system and global styles.",
  "frontend/index.html": "HTML entry point with meta tags, SEO data, and root mounting point loading main.jsx.",
  "frontend/README.md": "Frontend README describing prerequisites, setup steps, development commands, and project structure basics.",
  "frontend/src/App.jsx": "React app router setup using TanStack Router and next-themes to define all site routes with hash-based navigation.",
  "frontend/src/App.tsx": "TypeScript version of the app router configuring routes, theme provider, and TanStack Router type registration.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with branding, navigation links, social icons, and smooth-scrolling contact link behavior. Pulls site info from useSiteInfo.",
  "frontend/src/components/SiteLayout.tsx": "Wraps the app layout with theme provider, navbar, main content outlet, and footer. Ensures consistent page structure.",
  "frontend/src/components/SiteNavbar.tsx": "Provides a responsive navbar with navigation links, theme/preset controls, and a mobile drawer menu. Integrates theme switching and color presets.",
  "frontend/src/components/TestimonialsSlider.tsx": "Displays a carousel of static testimonials with navigation controls and rating stars. Manages active testimonial state and transitions.",
  "frontend/src/components/ThemeColorProvider.tsx": "Supplies theme color context using useThemeColor, exposing presets and preset switching. Wraps children with a context provider.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor with React Query, refetching dependent queries when identity changes. Returns actor instance and loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider using AuthClient, exposing identity state, login, logout, and status flags. Loads stored identities and manages authentication lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file intended for future backend-related React Query hooks. Currently exports nothing.",
  "frontend/src/hooks/useSiteInfo.ts": "Fetches site info from the backend actor with fallback static values, using React Query. Returns name, tagline, and loading/error state.",
  "frontend/src/hooks/useThemeColor.ts": "Defines theme color presets and a hook that loads, validates, applies, and stores the selected theme preset.",
  "frontend/src/index.css": "Sets global Tailwind-based styles and CSS variables for light/dark themes with extensive responsive rules.",
  "frontend/src/main.jsx": "Bootstraps the React app using ReactDOM, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/main.tsx": "TypeScript version of the React app entry point, rendering App with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/About.tsx": "Renders the About page with hero content, agency story, and value cards.",
  "frontend/src/pages/Booking.tsx": "Implements a booking form with state handling, preset package support, submission feedback, and a WhatsApp contact link.",
  "frontend/src/pages/Home.tsx": "Builds the home page with a hero section, featured destinations, contact form, and site info integration.",
  "frontend/src/pages/HoneymoonOffers.tsx": "Displays a list of honeymoon travel offers with details, images, and a hero section layout.",
  "frontend/src/pages/Privacy.tsx": "Renders the site's privacy policy using card sections outlining data collection and usage.",
  "frontend/src/pages/Services.tsx": "Shows a services overview page with hero sections and a grid of service cards like flights, hotels, and transportation.",
  "frontend/src/pages/TourGuide.tsx": "Presents information about tour guides, including hero content, explanatory text, images, and feature cards.",
  "frontend/src/pages/TourPackages.tsx": "Displays a list of tour packages with details, images, and a hero section for navigation.",
  "frontend/src/pages/Vehicles.tsx": "React page that displays a hero section and a grid of vehicle cards using predefined vehicle data.",
  "frontend/src/utils/slug.ts": "Utility functions to normalize, validate, and generate deterministic deployment-friendly slugs based on input or hostname.",
  "frontend/src/vite-env.d.ts": "TypeScript declaration file enabling Vite-specific types.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, fonts, animations, and container settings.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-based tooling, configuring module resolution and compiler options for Vite.",
  "frontend/vite.config.ts": "Vite configuration enabling React, path aliases, env definition, dev server settings, and build output settings.",
  "project_state.json": "Project state metadata describing deployment issues, existing features, and pending feature requests."
}