{
  "kind": "build_request",
  "title": "Deploy and host the existing website without modifying any project files",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Deploy the existing project to the Internet Computer as-is (frontend static assets + backend canister) using the repository’s current files, dependencies, configuration, and folder structure, and do not make any modifications to code, assets, configuration, or project structure as part of completing the deployment.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Please deploy and host my website.\nDo not modify, optimize, refactor, rename, or remove any files, folders, code, assets, dependencies, configurations, or structure.\nThe website must be hosted exactly as provided."
        ]
      },
      "acceptanceCriteria": [
        "No files, folders, code, assets, dependencies, configurations, or structure are modified to complete deployment.",
        "Deployment includes both canisters needed by the project (frontend static asset canister and Motoko backend canister), matching the project’s existing architecture.",
        "The deployed site is publicly accessible on IC mainnet."
      ]
    },
    {
      "id": "REQ-2",
      "text": "After deployment, verify the live site end-to-end: all routes/pages load, all navigation links work, scripts/styles load correctly, and all media/assets render without missing files; verify the browser DevTools Console shows no warnings or errors on initial load and during navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Ensure all pages, links, scripts, styles, and media work correctly\nDo not display any warnings or errors"
        ]
      },
      "acceptanceCriteria": [
        "All primary pages (e.g., Home, About, Services, Tour Packages, Honeymoon Offers, Vehicles, Tour Guide, Booking, Privacy) render successfully on the live URL.",
        "All navbar/footer links and in-app navigation work without broken routes.",
        "No missing asset/network errors when loading pages and images.",
        "Browser console shows zero errors and zero warnings during initial load and when navigating between pages."
      ]
    },
    {
      "id": "REQ-3",
      "text": "After successful deployment and verification, provide the final live public URL for the hosted website as the only output (no additional text).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "After successful deployment, generate and share the live public URL.\nProvide only the final hosted link after deployment"
        ]
      },
      "acceptanceCriteria": [
        "A single public URL (e.g., https://<frontend-canister-id>.ic0.app) is produced after deployment.",
        "The response contains only the URL and no additional explanatory text."
      ]
    }
  ],
  "constraints": [
    "Do not modify, optimize, refactor, rename, or remove any files, folders, code, assets, dependencies, configurations, or structure.",
    "Maintain exact folder hierarchy and file integrity.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding missing configuration files (e.g., creating/updating root dfx.json) or editing deployment configuration.",
    "Changing dependencies, adding/removing packages, or introducing build-system changes (e.g., adding/changing frontend/package.json scripts).",
    "Refactoring frontend/backend code for performance or cleanliness.",
    "Feature development unrelated to deployment/hosting."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}